In [17]:
import pymysql

import pandas as pd

In [32]:
import warnings
warnings.filterwarnings('ignore')

In [54]:
conn = pymysql.connect(host='localhost', port=int(3306), user='root', passwd=passwd, db='mydb')

In [55]:
cursor = conn.cursor(pymysql.cursors.DictCursor)

In [56]:
log_df=pd.read_sql_query("SELECT * FROM LogTable ",conn)

In [57]:
log_df

   id   user id user pwd         login time
0   1   jamesid     1234  2022-12-03-171022
1   2   davidid     4324  2022-12-03-181022
2   3  gerogeid     4567  2022-12-03-181125

In [58]:
user_df=pd.read_sql_query("SELECT * FROM UserTable ",conn)

In [59]:
user_df

,id,name,birth,email,passwd,phone_number,sex,age,Log table_id
0,1,james,19970301,james@inha.edu,1234,01044443333,M,26,2
1,2,david,19780301,david@inha.edu,4567,01055553433,M,45,3
2,3,george,19870308,george@inha.edu,4324,01044443333,M,36,1

In [37]:
Admin_df=pd.read_sql_query("SELECT * FROM ADMIN ",conn)

In [38]:
Admin_df

,User table_id,posistion,permission,company,Error_id,Task change log_id,DB setting Table_id
0,1,CTO,Write,NAVER,1,1,1

In [39]:
TaskChangeLog_df=pd.read_sql_query("SELECT * FROM TaskChangeLog ",conn)

In [40]:
TaskChangeLog_df

   id task name request date acceptance deployment deploy date
0   1    george     20220809     george     george    20220813

In [41]:
Error_df=pd.read_sql_query("SELECT * FROM ErrorTable ",conn)

In [42]:
Error_df

   id Error date  fix date engineer error report
0   1   20220811  20220813   george         True

In [43]:
dbset_df=pd.read_sql_query("SELECT * FROM DBSettingTable",conn)

In [44]:
dbset_df

   id   device ip address      os register date
0   1  samsung    1278080  Window      20220711

In [45]:
customer_df = pd.read_sql_query("SELECT * FROM Customer",conn)

In [46]:
customer_df

   User table_id Validate permission login path validate path
0              2     True       Read      NAVER           SKT

In [47]:
reserve_df = pd.read_sql_query("SELECT * FROM Reservation",conn)

In [48]:
reserve_df

,reservation id,seat number,price,User table_id,Event table_id,Seat table_id,Artist table_id
0,1,31,30000,1,1,1,1

In [60]:
Event_df = pd.read_sql_query("SELECT * FROM EventTable",conn)

In [61]:
Event_df

,id,concert name,genre,rate,start time,end time,date,Artist table_id,Concert hall address,Concert hall max
0,1,davich concert,BALAD,ALL,20:00,21:00,20221231,1,"88-2 Bangi-dong, Songpa-gu, Seoul",1000
1,1,davich concert,BALAD,ALL,20:00,21:00,20221231,2,"88-2 Bangi-dong, Songpa-gu, Seoul",1000

In [63]:
Artist_EVENT_df = pd.read_sql_query("SELECT * FROM ArtistTable",conn)

In [64]:
Artist_EVENT_df

   id    name count artist lists  Artist info_id
0   1  davich     2          1,2               1
1   2  davich     2          1,2               2

In [65]:
Artist_info_df = pd.read_sql_query("SELECT * FROM Artistinfo",conn)

In [66]:
Artist_info_df

   id            name sex age  debut date    role
0   1      LEE HAE RI   F  30  2008.11.03  Singer
1   2  KANG MIN KYUNG   F  30  2008.11.03  Singer

In [67]:
Artist_song_df = pd.read_sql_query("SELECT * FROM ArtistSongTable",conn)

In [68]:
Artist_song_df

   Artist table_id     Song list
0                1  Turtle, 8282
1                2  Turtle, 8282